<a href="https://colab.research.google.com/github/a-dhingra/pandas_exercises/blob/master/05_Merge/Housing%20Market/Exercises_SolvedBySelf.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1,4,100))
s2 = pd.Series(np.random.randint(1,3,100))
s3 = pd.Series(np.random.randint(10000,30000,100))

In [3]:
s1[:5]

0    1
1    2
2    2
3    3
4    3
dtype: int64

In [7]:
s2[:10]

0    1
1    2
2    2
3    2
4    2
5    1
6    1
7    1
8    2
9    1
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat([s1,s2,s3], axis=1 ) # axis=1 means columns
df.head()

   0  1      2
0  1  1  26780
1  2  2  17625
2  2  2  23364
3  3  2  16202
4  3  2  25733

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df = df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'})
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            26780
1      2       2            17625
2      2       2            23364
3      3       2            16202
4      3       2            25733

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
# bigcolumn.shape
bigcolumn = bigcolumn.to_frame()
bigcolumn.tail(20)

        0
80  13857
81  12167
82  28382
83  19687
84  22390
85  21905
86  24805
87  29057
88  17295
89  27947
90  13135
91  12873
92  13750
93  19176
94  11241
95  18512
96  18631
97  28023
98  17369
99  19307

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [16]:
bigcolumn.tail()

        0
95  18512
96  18631
97  28023
98  17369
99  19307

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail()

         0
295  18512
296  18631
297  28023
298  17369
299  19307